{
  "welcome": "Chào mừng đến với portfolio của tôi",
  "about": "Giới thiệu",
  "contact": "Liên hệ",
  "skills": "Kỹ năng",
  "experience": "Kinh nghiệm",
  "projects": "Dự án",
  "banner_hello": "Xin chào, tôi là Thái Nhật Tiến",
  "banner_desc": "Tôi là lập trình viên web, chuyên thiết kế và phát triển website trên nền tảng WordPress. Thành thạo sử dụng các công cụ như Elementor, Flatsome, và Beaver Builder, tôi có khả năng xây dựng giao diện tùy chỉnh, phát triển plugin theo yêu cầu và tối ưu hóa hiệu năng trang web.\nBên cạnh đó, tôi cũng có nền tảng kỹ thuật vững chắc với Java / Spring Boot (backend) và ReactJS / AngularJS (frontend), sẵn sàng đảm nhận các dự án full-stack khi cần. Tôi luôn ưu tiên kiến trúc rõ ràng, mã nguồn dễ bảo trì và trải nghiệm người dùng mượt mà.",
  "learn_more": "Tìm hiểu thêm",
  "banner_img_alt": "minh họa nữ lập trình viên",
  "things_title": "Kỹ năng chuyên môn",
  "frontend_title": "Phát triển Frontend",
  "frontend_desc": "Thành thạo ReactJS, AngularJS, HTML, CSS, Bootstrap, TailwindCSS. Tạo ra giao diện người dùng hiện đại, responsive và tối ưu trải nghiệm.",
  "backend_title": "Phát triển Backend",
  "backend_desc": "Chuyên sâu Java, Spring Boot, RESTful API, PHP, NodeJS. Thiết kế kiến trúc nhiều tầng với SQL Server, MySQL, MongoDB.",
  "wordpress_title": "WordPress & DevOps",
  "wordpress_desc": "Phát triển theme/plugin WordPress tùy chỉnh (Elementor, Flatsome). Git, Github, Gitlab.",
  "things_dec_l_alt": "minh họa chiếc lá bên trái",
  "things_dec_r_alt": "minh họa chiếc lá bên phải",
  "career_goal": "Mục tiêu nghề nghiệp",
  "career_goal_desc": "Mục tiêu của tôi là phát triển sự nghiệp trở thành một Full‑stack Engineer chuyên sâu, có khả năng tham gia và đóng góp hiệu quả trong các dự án quy mô lớn. Tôi mong muốn được phát triển sâu hơn trong mảng xây dựng website thực tế, bao gồm cả lập trình giao diện và backend, đặc biệt là trên nền tảng WordPress và các công nghệ web hiện đại. Luôn chủ động học hỏi, tôi cam kết mang lại giá trị bền vững cho sản phẩm và đội ngũ phát triển.",
  "work_experience": "Kinh nghiệm làm việc",
  "education": "Học vấn",
  "school_name": "Cao đẳng FPT Polytechnic",
  "major": "Công nghệ thông tin",
  "school_period": "08/2022 - 12/2024",
  "graduation_type": "Tốt nghiệp loại",
  "graduation_type_excellent": "Giỏi",
  "with_gpa": "với GPA",
  "tech_skills": "Công nghệ & Kỹ năng",
  "backend": "Backend",
  "frontend": "Frontend",
  "database": "Cơ sở dữ liệu",
  "wordpress": "WordPress",
  "devops": "DevOps",
  "testing": "Kiểm thử",
  "exp1_title": "Web Developer",
  "exp1_company": "Puramu",
  "exp1_period": "02/2025 - Hiện tại",
  "exp1_desc": "Thiết kế & phát triển nhiều website thương mại điện tử/giới thiệu dịch vụ trên WordPress. Xây dựng plugin tùy chỉnh (tích hợp khuyến mãi, API bên thứ ba, dashboard quản trị). Tối ưu SEO & hiệu suất.",
  "exp2_title": "Web Developer",
  "exp2_company": "Bizibusiness",
  "exp2_period": "10/2024- 12/2024",
  "exp2_desc": "Tham gia dự án nội bộ, sử dụng plugin Beaver Builder để tạo landing page.",
  "works_title": "Dự án đã triển khai",
  "view_website": "Xem website",
  "work_dec_l_alt": "minh họa chiếc lá bên trái phần dự án",
  "work_dec_r_alt": "minh họa chiếc lá bên phải phần dự án",
  "footer_heading": "Sẵn sàng hợp tác và tạo ra điều tuyệt vời?",
  "footer_dec_l_alt": "minh họa chiếc lá bên trái phần footer",
  "footer_bg_alt": "minh họa nữ lập trình viên phần footer",
  "work1_title": "Đồng phục Tiến Phát",
  "work1_desc": "Website giới thiệu và đặt đồng phục áo dài, tích hợp giá cả và tư vấn trực tuyến.",
  "work2_title": "Bảo hành thiết bị LG Hà Nội",
  "work2_desc": "Website bảo hành và sửa chữa thiết bị LG tại Hà Nội, tối ưu hóa cho SEO và trải nghiệm khách hàng.",
  "work3_title": "COIDB",
  "work3_desc": "Website giới thiệu doanh nghiệp, tích hợp hỗ trợ nhiều ngôn ngữ và biểu mẫu liên hệ.",
  "work4_title": "Bất động sản Thailand",
  "work4_desc": "Website thông tin bất động sản, đăng tin bán, tìm kiếm bất động sản.",
  "work5_title": "Nội thất Modern",
  "work5_desc": "Website giới thiệu sản phẩm nội thất nhôm, tích hợp catalog và tư vấn.",
  "work6_title": "Dịch vụ mai táng Thanh Bình",
  "work6_desc": "Website dịch vụ tư vấn và đặt lễ, tư vấn trực tuyến.",
  "work7_title": "ArtLive",
  "work7_desc": "Website giới thiệu dịch vụ nghệ thuật, portfolio nghệ sĩ.",
  "work8_title": "Lusa Connect",
  "work8_desc": "Website bán tai nghe, xe điện, camera.",
  "work9_title": "Tường Long Pack",
  "work9_desc": "Website giới thiệu sản phẩm đóng gói, tích hợp giá cả và tư vấn."
}